emacs/org-mode.common.org
Save every 30s of inactivity
#+begin_src emacs-lisp
  (add-hook 'auto-save-hook 'org-save-all-org-buffers)
#+end_src

Open agenda on startup
#+begin_src emacs-lisp
  ;;(org-agenda-list)
  ;;(switch-to-buffer "*Org Agenda*")
  ;;(spacemacs/toggle-maximize-buffer)
#+end_src

Custom agenda showing a block with weekly goals
#+begin_src emacs-lisp
  (setq org-agenda-custom-commands
     '(("n" "Agenda, goals, all TODO"
       ;; One block with a standard agenda view
         ((agenda "")
          ;; One block of All tasks tagged :goal:
          (tags-todo "goal")
          ;; One block of ALL tasks that are TODOs
          ((alltodo "") )
          ))))
;; attempting to add:
;; (org-agenda-skip-if 
;;   '(org-agenda-skip-entry-if '("-goal")))
#+end_src

Don't split windows when displaying agenda
#+begin_src emacs-lisp
  (setq org-agenda-window-setup 'current-window)
#+end_src
  
Hook for toggling visual word wrap
#+begin_src emacs-lisp
  (add-hook 'text-mode-hook 'turn-on-visual-line-mode)
#+end_src
  
Change ellipsis
Alt: ▼, ↴, ⬎, ⤷, ⤵, and ⋱
#+begin_src emacs-lisp
  (setq org-ellipsis "↴")
#+end_src


#+begin_src emacs-lisp
  (setq org-todo-keywords
        '((sequence "TODO(t)" "PRIORITY(P)" "IN-PROGRESS(p!)" "WAITING(w@)" "|" "DONE(d!)" "CANCELLED(c@)")))
    #+end_src

